const hadiths = [
  {
    hadith:
      "মহান আল্লাহর বাণীঃ ’’হে মু’মিনগণ! তোমাদের জন্য সিয়াম ফরজ করা হল, যেমন ফরজ করা হয়েছিল তোমাদের পূর্ববর্তীদের উপর, যেন তোমরা মুত্তাকী হতে পার।’’",
    referenceBook: "(আল-বাকারাহ্ঃ ১৮৩)",
  },
  {
    hadith:
      "কোন স্ত্রীর মধ্যে স্বামীর প্রতি অবাধ্যতার লক্ষণ দেখা দিলে স্ত্রীকে সদুপদেশ দিতে হবে। প্রয়োজনে তার শয্যা ত্যাগ করতে হবে, শিক্ষামূলক প্রহার করতে হবে।",
    referenceBook: "(সূরা আন-নিসাঃ ৩৪)",
  },
  {
    hadith:
      "আব্দুল আযীয ইবনে আব্দুল্লাহ উয়ায়সী (রাহঃ) .... আবু হুরায়রা (রাযিঃ) থেকে বর্ণিত, নবী (ﷺ) বলেছেন, যে ব্যক্তি মানুষের মাল (ধার) নেয় পরিশোধ করার উদ্দেশ্যে আল্লাহ তা‘আলা তা আদায়ের ব্যবস্থা করে দেন। আর যে তা নেয় বিনষ্ট করার নিয়তে আল্লাহ তা‘আলা তাকে ধ্বংস করেন।",
    referenceBook: "(সহীহ বুখারী)",
  },
  {
    hadith:
      "মহান আল্লাহর বাণীঃ হে জিন ও মানব জাতি! তোমাদেরই মধ্য থেকে রাসুলগণ কি তোমাদের কাছে আসেন নি? তারা কি তোমাদের সামনে আমার নিদর্শনাবলী বর্ণনা করেন নি?",
    referenceBook: "(সূরা আন’আমঃ ১৩০)",
  },
  {
    hadith:
      "মুসাদ্দাদ (রাহঃ) .... আয়িশা (রাযিঃ) থেকে বর্ণিত, নবী (ﷺ) বলেন, পাঁচ প্রকার প্রাণী বেশী অনিষ্টকারী। এদেরকে হারাম শরীফেও হত্যা করা যায়। এগুলো হল বিচ্ছু, ইঁদুর, চিল, কাক এবং পাগলা কুকুর।",
    referenceBook: "(সহীহ বুখারী)",
  },
  {
    hadith: "আল্লাহর নিকট দুআর বিষয়টি বিশ্বাস ও দৃঢ়তার সাথে বারবার চাওয়া।",
    referenceBook: "(বুখারী, হাদীস নং-৬৩৩৮)",
  },
  {
    hadith:
      " আয়না দেখার সময় এই দোয়া পড়া- اللهم حسنت خلقي فحسن خلقی অর্থ: হে আল্লাহ আপনি আমার যেরুপ সুন্দও চেহারা দান করেছেন তদ্রুপ আমার স্বভাব-চরিত্রকেও সুন্দর করে দিন।",
    referenceBook: "( হিসনে হাসীন)",
  },
  {
    hadith:
      "তিনিই আল্লাহ, যিনি ছাড়া কোন মাবুদ নেই। তিনি বাদশাহ, পবিত্রতার অধিকারী, শান্তিদাতা, নিরাপত্তাদাতা, সকলের রক্ষক, মহা ক্ষমতাবান, সকল দোষ-ত্রুটির সংশোধনকারী, গৌরবান্বিত, তারা যে শিরক করে তা থেকে আল্লাহ পবিত্র।",
    referenceBook: "(সূরা আন’আমঃ ১৩০)",
  },
  {
    hadith:
      "মহান আল্লাহর বাণীঃ হে জিন ও মানব জাতি! তোমাদেরই মধ্য থেকে রাসুলগণ কি তোমাদের কাছে আসেন নি? তারা কি তোমাদের সামনে আমার নিদর্শনাবলী বর্ণনা করেন নি?",
    referenceBook: "(সূরা আল হাশ্‌র: ২৩)",
  },
  {
    hadith: "তিনি মানুষকে সৃষ্টি করেছেন জমাট রক্ত দ্বারা",
    referenceBook: "(সূরা আল আলাক: ২)",
  },
  {
    hadith:
      " আবু বকর ইবনে আবি শাঈবা, আবু কুরায়ব ও ইসহাক (রাহঃ) ......... আয়িশা (রাযিঃ) থেকে বর্ণিত। তিনি বলেন, আমি রাসূলুল্লাহ (ﷺ) কে (যিলহজ্জের) দশ দিন কখনও রোযা পালন করতে দেখিনি**।",
    referenceBook: "(সহীহ বুখারী)",
  },
  {
    hadith:
      "হারামালা ইবনে ইয়াহয়া, ইসহাক ইবনে ইবরাহীম ও আব্দ ইবনে হুমায়দ (রাহঃ) ......... যুহরী (রাহঃ) থেকে উল্লেখিত সনদে হাদীস রিওয়ায়াত করেছেন। তবে তাঁদের দু’জনের বর্ণিত হাদীসে ’ভয় পেয়ে জ্বরাক্রান্ত হয়ে পড়তাম’ কথাটি নেই। আর (প্রথম সনদে) রাবী ইউনুস (রাহঃ) অধিক বলেছেন, যখন সে ঘুম থেকে জেগে উঠবে, তখন সে যেন তিনবার তার বামদিকে থু–থু ফেলে।",
    referenceBook: "(সহীহ মুসলিম)",
  },
  {
    hadith:
      "কুতায়বা ইবনে সাঈদ ও ইবনে রুমহ (রাহঃ) ......... জাবির (রাযিঃ) সূত্রে বর্ণিত। তিনি বলেছেনঃ তোমাদের কেউ যখন এমন স্বপ্ন দেখল যা সে অপছন্দ করে, তখন সে যেন তার বামদিকে তিনবার থু থু নিক্ষেপ করে এবং শয়তান (এর চক্রান্ত) থেকে আল্লাহর কাছে তিনবার আশ্রয় প্রার্থনা করে এবং যে কাতে নিদ্রিত ছিল, তা থেকে যেন পার্শ্ব পরিবর্তন করে (ঘুমায়)।",
    referenceBook: "(সহীহ মুসলিম)",
  },
  {
    hadith:
      "কুতায়বা ইবনে সাঈদ (রাহঃ) ......... আবু হুরায়রা (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ (ﷺ) বলেনঃ দুনিয়া মুমিনের জন্য জেলখানা এবং কাফিরের জন্য জান্নাত (স্বরূপ)।",
    referenceBook: "(সহীহ মুসলিম)",
  },
  {
    hadith:
      "মহান আল্লাহর বাণীঃ হে জিন ও মানব জাতি! তোমাদেরই মধ্য থেকে রাসুলগণ কি তোমাদের কাছে আসেন নি? তারা কি তোমাদের সামনে আমার নিদর্শনাবলী বর্ণনা করেন নি?",
    referenceBook: "(সূরা আল হাশ্‌র: ২৩)",
  },
  {
    hadith:
      "কুতায়বা ইবনে সাঈদ (রাহঃ) ......... আবু হুরায়রা (রাযিঃ) থেকে বর্ণিত। রাসূলুল্লাহ (ﷺ) বলেনঃ দুনিয়া মুমিনের জন্য জেলখানা এবং কাফিরের জন্য জান্নাত (স্বরূপ)।",
    referenceBook: "(সহীহ মুসলিম)",
  },
  {
    hadith: " হে আমার রব! আমাকে সৎ, কর্মপরায়ণ সন্তান দান করুন",
    referenceBook: "(সূরা আস-সাফফাত: ১০০)",
  },
];

document.getElementById("btn").addEventListener("click", function () {
  const qoute = document.getElementById("head");
  const p = document.getElementById("name");

  const gen = Math.floor(Math.random() * hadiths.length);

  qoute.innerText = hadiths[gen].hadith;
  p.innerText = hadiths[gen].referenceBook;
});
